test/integration/data.pyvmomi.inv/request-446.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <RetrievePropertiesEx xmlns="urn:vim25">
      <_this type="PropertyCollector">propertyCollector</_this>
      <specSet>
        <propSet>
          <type>ComputeResource</type>
          <all>false</all>
          <pathSet>resourcePool</pathSet>
        </propSet>
        <objectSet>
          <obj type="ComputeResource">domain-s38</obj>
          <skip>false</skip>
        </objectSet>
      </specSet>
      <options>
        <maxObjects>1</maxObjects>
      </options>
    </RetrievePropertiesEx>
  </soapenv:Body>
</soapenv:Envelope>
